{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "bert-base-cased",
  "bias": "lora_only",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.2,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "classifier",
    "classifier",
    "score"
  ],
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "output.dense",
    "key",
    "query",
    "value"
  ],
  "task_type": "TOKEN_CLS",
  "use_dora": false,
  "use_rslora": false
}
